#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhysicObject_OilLamp

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_PhysicObject_OilLamp.BP_PhysicObject_OilLamp_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_PhysicObject_OilLamp_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_NotEqual_LinearColorLinearColor_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_BP_PhysicObject_OilLamp_C_UserConstructionScript;

// Function BP_PhysicObject_OilLamp.BP_PhysicObject_OilLamp_C.ExecuteUbergraph_BP_PhysicObject_OilLamp
// 0x0020 (0x0020 - 0x0000)
struct BP_PhysicObject_OilLamp_C_ExecuteUbergraph_BP_PhysicObject_OilLamp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentRHI_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_BP_PhysicObject_OilLamp_C_ExecuteUbergraph_BP_PhysicObject_OilLamp;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
