#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhysicObject_Chain_Bell

#include "Basic.hpp"

#include "BP_PhysicObject_Chain_classes.hpp"
#include "Engine_structs.hpp"
#include "S_Activable_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_PhysicObject_Chain_Bell.BP_PhysicObject_Chain_Bell_C
// 0x0030 (0x03E0 - 0x03B0)
class ABP_PhysicObject_Chain_Bell_C final : public ABP_PhysicObject_Chain_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PhysicObject_Chain_Bell_C;       // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            ConstraintRinger;                                  // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Bell_Ringer;                                    // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_Activable>                   activables;                                        // 0x03D0(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_PhysicObject_Chain_Bell(int32 EntryPoint);
	void F_Child_PhysicStart(class AActor* Owner_0);
	void F_GetInteractableDatas(struct FS_InteractableDatas* InteractableDatas);
	void F_Interact(class AActor* Owner_0, int32 Wildcard);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PhysicObject_Chain_Bell_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PhysicObject_Chain_Bell_C")
	}
	static class ABP_PhysicObject_Chain_Bell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PhysicObject_Chain_Bell_C>();
	}
};
// DUMPER7_ASSERTS_ABP_PhysicObject_Chain_Bell_C;

SDK_NAMESPACE_END
