#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhysicObject_CandleHandler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_PhysicObject_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_PhysicObject_CandleHandler.BP_PhysicObject_CandleHandler_C
// 0x0030 (0x0388 - 0x0358)
class ABP_PhysicObject_CandleHandler_C final : public ABP_PhysicObject_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PhysicObject_CandleHandler_C;    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          candle;                                            // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CustomColor;                                       // 0x0374(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void F_Child_PhysicStart(class AActor* Owner_0);
	void ExecuteUbergraph_BP_PhysicObject_CandleHandler(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PhysicObject_CandleHandler_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PhysicObject_CandleHandler_C")
	}
	static class ABP_PhysicObject_CandleHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PhysicObject_CandleHandler_C>();
	}
};
// DUMPER7_ASSERTS_ABP_PhysicObject_CandleHandler_C;

SDK_NAMESPACE_END
