#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhysicObject_HangingBottle_A

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_PhysicObject_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_PhysicObject_HangingBottle_A.BP_PhysicObject_HangingBottle_A_C
// 0x0030 (0x0388 - 0x0358)
class ABP_PhysicObject_HangingBottle_A_C : public ABP_PhysicObject_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PhysicObject_HangingBottle_A_C;  // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPhysicsConstraintComponent*            Chain2;                                            // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            Chain1;                                            // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_WindGusts_C*                        AC_WindGusts;                                      // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          Stream;                                            // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)

public:
	void ExecuteUbergraph_BP_PhysicObject_HangingBottle_A(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PhysicObject_HangingBottle_A_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PhysicObject_HangingBottle_A_C")
	}
	static class ABP_PhysicObject_HangingBottle_A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PhysicObject_HangingBottle_A_C>();
	}
};
// DUMPER7_ASSERTS_ABP_PhysicObject_HangingBottle_A_C;

SDK_NAMESPACE_END
