#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhysicObject_CandleBowl

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_PhysicObject_CandleBowl.BP_PhysicObject_CandleBowl_C.F_Child_PhysicStart
// 0x0008 (0x0008 - 0x0000)
struct BP_PhysicObject_CandleBowl_C_F_Child_PhysicStart final
{
public:
	class AActor*                                 Owner_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_BP_PhysicObject_CandleBowl_C_F_Child_PhysicStart;

// Function BP_PhysicObject_CandleBowl.BP_PhysicObject_CandleBowl_C.ExecuteUbergraph_BP_PhysicObject_CandleBowl
// 0x0020 (0x0020 - 0x0000)
struct BP_PhysicObject_CandleBowl_C_ExecuteUbergraph_BP_PhysicObject_CandleBowl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner;                                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_BP_PhysicObject_CandleBowl_C_ExecuteUbergraph_BP_PhysicObject_CandleBowl;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
