#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhysicObject_CandleBowl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_PhysicObject_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_PhysicObject_CandleBowl.BP_PhysicObject_CandleBowl_C
// 0x0040 (0x0398 - 0x0358)
class ABP_PhysicObject_CandleBowl_C final : public ABP_PhysicObject_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PhysicObject_CandleBowl_C;       // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          Stream;                                            // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	struct FLinearColor                           CustomColor;                                       // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void F_Child_PhysicStart(class AActor* Owner_0);
	void ExecuteUbergraph_BP_PhysicObject_CandleBowl(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PhysicObject_CandleBowl_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PhysicObject_CandleBowl_C")
	}
	static class ABP_PhysicObject_CandleBowl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PhysicObject_CandleBowl_C>();
	}
};
// DUMPER7_ASSERTS_ABP_PhysicObject_CandleBowl_C;

SDK_NAMESPACE_END
