#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dartboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_DartPlayerValues_structs.hpp"
#include "E_DamageCategory_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Dartboard.BP_Dartboard_C
// 0x0088 (0x0338 - 0x02B0)
class ABP_Dartboard_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DartboardCenter;                                   // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GameArea;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          InteractBox;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_DartGame;                                       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FST_DartPlayerValues>           playerScore;                                       // 0x02E0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify)
	class UUI_DartGame_Scoreboard_C*              UI_DartGameScoreboard;                             // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          DirtyGameEnd;                                      // 0x02F8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        ShootAreasLocation;                                // 0x0300(0x0010)(Edit, BlueprintVisible)
	int32                                         TimerCounter;                                      // 0x0310(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGameStarted;                                     // 0x0314(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CooldownTimerHandle;                               // 0x0318(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PreGameStarted;                                    // 0x0320(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Timer_C*                            UI_Timer;                                          // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           PulserCheckIfPlayerIsOnline;                       // 0x0330(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Dartboard_ExitGame_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_BP_Dartboard(int32 EntryPoint);
	void F_Activate(int32 Wildcard, double Delay, class AActor* Owner_0);
	void F_Activate_Location(const struct FVector& Location, class AActor* Owner_0, int32 Wildcard, class UPrimitiveComponent* Component);
	void F_AddImpulseServer(const struct FVector& HitNormal, const struct FVector& Location);
	void F_Bounce(const struct FVector& DirectionAxis, const struct FVector& BounceLoc);
	void F_BuffManagerClearBuffFromActor(class UClass* Buff);
	void F_CanBeAutoAimed(bool* CanBeAutoAimed, struct FVector* autoAimedLocation);
	void F_Channel(class AActor* ChannelingOwner, int32 Wildcard);
	bool F_CheckIfPlayerHasDart(class APlayerState* PlayerState);
	void F_CheckPlayerStatus();
	void F_CooldownCounter();
	void F_DamageFeedback(const struct FHitResult& Hit, class AActor* Owner_0, double Damages, class UClass* DamageType, bool Critical, E_DamageCategory Element, class FName ItemName);
	void F_DestroyShootZone();
	void F_EventAlert();
	void F_GetBuffs(bool* Found, TArray<class UClass*>* BuffObjects);
	void F_GetInteractableDatas(struct FS_InteractableDatas* InteractableDatas);
	void F_GetShootAtLoc(bool* Found, struct FVector* Loc, class USceneComponent** SceneComponent);
	void F_HitMarkerRequest(bool Critical, bool* Receive);
	void F_HoverInteract();
	void F_Interact(class AActor* Owner_0, int32 Wildcard);
	bool F_IsMaxPointsReached(class APlayerState** Winner);
	void F_IsPlayerStateInList(class AActor* Owner_0, class ABP_PlayerState_C** AsBP_Player_State, bool* Found, int32* Index_0);
	void F_KillCombo();
	void F_PassWildcard(int32 Wildcard);
	void F_PingObject(bool* canBePinged, class UClass** pingActor, class FText* ChatLine, class USceneComponent** AttachedComponent);
	void F_QuestProgress(class FName Tag);
	void F_ReceiveBuff(class AActor* Owner_0, const struct FVector& ReceivedLoc, class UClass* BuffObject);
	void F_RemoveBuff(class UClass* BuffObject);
	void F_RemoveNiagaraSystemOnEnemy(class UNiagaraSystem* System);
	void F_SendUnlockables(const TArray<class UClass*>& Unlockables);
	void F_ServerDamages(double Damages, class UClass* DamageType, class AActor* Causer, E_DamageCategory Element, class FName ItemName);
	void F_ServerExplosion(class FName ExplosionName, double Damages, class AActor* Causer);
	void F_SetAttachedActor(class AActor* AttachedActor);
	void F_SetCanBeDestroyedIfNoPlayerAround();
	void F_SetCustomMaterialParameter(class FName Param, double Value);
	void F_SpawnNiagaraSystemOnEnemy(class UNiagaraSystem* System);
	void F_StartInteract(class AActor* Owner_0);
	void F_StartPhysic(class UPrimitiveComponent* Component, const struct FVector& HitLoc, const struct FVector& Normal, double Strenght, class AActor* hitOwner, E_DamageCategory DamageCategory);
	void F_StopChannel(class AActor* ChannelingActor);
	void F_StopInteract(class AActor* Owner_0);
	void F_TriggerTalisman(class ABP_Item_C* Item, class AActor* WildClassActor);
	void OnRep_DirtyGameEnd();
	void OnRep_PlayerScore();
	void OnRep_TimerCounter();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Dartboard_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Dartboard_C")
	}
	static class ABP_Dartboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Dartboard_C>();
	}
};
// DUMPER7_ASSERTS_ABP_Dartboard_C;

SDK_NAMESPACE_END
