#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Enemy_TrainingTarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Enemy_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Enemy_TrainingTarget.BP_Enemy_TrainingTarget_C
// 0x0020 (0x0900 - 0x08E0)
class ABP_Enemy_TrainingTarget_C final : public ABP_Enemy_C
{
public:
	uint8                                         Pad_8D1[0x7];                                      // 0x08D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Enemy_TrainingTarget_C;          // 0x08D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Critical;                                          // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlayerCollision;                                   // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Enemy_TrainingTarget(int32 EntryPoint);
	void F_RemoveNiagaraSystemOnEnemy(class UNiagaraSystem* System);
	void F_SpawnNiagaraSystemOnEnemy(class UNiagaraSystem* System);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Enemy_TrainingTarget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Enemy_TrainingTarget_C")
	}
	static class ABP_Enemy_TrainingTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Enemy_TrainingTarget_C>();
	}
};
// DUMPER7_ASSERTS_ABP_Enemy_TrainingTarget_C;

SDK_NAMESPACE_END
