#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Enemy_TrainingTarget

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_Enemy_TrainingTarget.BP_Enemy_TrainingTarget_C.ExecuteUbergraph_BP_Enemy_TrainingTarget
// 0x0028 (0x0028 - 0x0000)
struct BP_Enemy_TrainingTarget_C_ExecuteUbergraph_BP_Enemy_TrainingTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_Event_System_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Event_System;                               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_BP_Enemy_TrainingTarget_C_ExecuteUbergraph_BP_Enemy_TrainingTarget;

// Function BP_Enemy_TrainingTarget.BP_Enemy_TrainingTarget_C.F_RemoveNiagaraSystemOnEnemy
// 0x0008 (0x0008 - 0x0000)
struct BP_Enemy_TrainingTarget_C_F_RemoveNiagaraSystemOnEnemy final
{
public:
	class UNiagaraSystem*                         System;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_BP_Enemy_TrainingTarget_C_F_RemoveNiagaraSystemOnEnemy;

// Function BP_Enemy_TrainingTarget.BP_Enemy_TrainingTarget_C.F_SpawnNiagaraSystemOnEnemy
// 0x0008 (0x0008 - 0x0000)
struct BP_Enemy_TrainingTarget_C_F_SpawnNiagaraSystemOnEnemy final
{
public:
	class UNiagaraSystem*                         System;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_BP_Enemy_TrainingTarget_C_F_SpawnNiagaraSystemOnEnemy;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
