#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GambaMachine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_Rarity_structs.hpp"
#include "E_DamageCategory_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_GambaMachine.BP_GambaMachine_C
// 0x0060 (0x0310 - 0x02B0)
class ABP_GambaMachine_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAC_SkeletalMeshOptimizer_C*            AC_SkeletalMeshOptimizer;                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_GambaAura;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_GamblingWagon_Lights;                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Alpha_2548749F47A102A65F4FD79BE53D40A7;   // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_2548749F47A102A65F4FD79BE53D40A7; // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 chosenTweak;                                       // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GambaMachine(int32 EntryPoint);
	void F_Activate(int32 Wildcard, double Delay, class AActor* Owner_0);
	void F_Activate_Location(const struct FVector& Location, class AActor* Owner_0, int32 Wildcard, class UPrimitiveComponent* Component);
	void F_AddImpulseServer(const struct FVector& HitNormal, const struct FVector& Location);
	void F_Bounce(const struct FVector& DirectionAxis, const struct FVector& BounceLoc);
	void F_BuffManagerClearBuffFromActor(class UClass* Buff);
	void F_CanBeAutoAimed(bool* CanBeAutoAimed, struct FVector* autoAimedLocation);
	void F_Channel(class AActor* ChannelingOwner, int32 Wildcard);
	void F_DamageFeedback(const struct FHitResult& Hit, class AActor* Owner_0, double Damages, class UClass* DamageType, bool Critical, E_DamageCategory Element, class FName ItemName);
	void F_EventAlert();
	void F_GetBuffs(bool* Found, TArray<class UClass*>* BuffObjects);
	void F_GetInteractableDatas(struct FS_InteractableDatas* InteractableDatas);
	void F_GetShootAtLoc(bool* Found, struct FVector* Loc, class USceneComponent** SceneComponent);
	void F_HitMarkerRequest(bool Critical, bool* Receive);
	void F_HoverInteract();
	void F_Interact(class AActor* Owner_0, int32 Wildcard);
	void F_KillCombo();
	void F_Optimize();
	void F_PassWildcard(int32 Wildcard);
	void F_PingObject(bool* canBePinged, class UClass** pingActor, class FText* ChatLine, class USceneComponent** AttachedComponent);
	void F_QuestProgress(class FName Tag);
	void F_ReceiveBuff(class AActor* Owner_0, const struct FVector& ReceivedLoc, class UClass* BuffObject);
	void F_RemoveBuff(class UClass* BuffObject);
	void F_RemoveNiagaraSystemOnEnemy(class UNiagaraSystem* System);
	void F_SelectTweak(class FName* Joker);
	void F_SendUnlockables(const TArray<class UClass*>& Unlockables);
	void F_ServerDamages(double Damages, class UClass* DamageType, class AActor* Causer, E_DamageCategory Element, class FName ItemName);
	void F_ServerExplosion(class FName ExplosionName, double Damages, class AActor* Causer);
	void F_SetAttachedActor(class AActor* AttachedActor);
	void F_SetCanBeDestroyedIfNoPlayerAround();
	void F_SetCustomMaterialParameter(class FName Param, double Value);
	void F_SpawnNiagaraSystemOnEnemy(class UNiagaraSystem* System);
	void F_StartInteract(class AActor* Owner_0);
	void F_StartPhysic(class UPrimitiveComponent* Component, const struct FVector& HitLoc, const struct FVector& Normal, double Strenght, class AActor* hitOwner, E_DamageCategory DamageCategory);
	void F_StopChannel(class AActor* ChannelingActor);
	void F_StopInteract(class AActor* Owner_0);
	void F_TriggerTalisman(class ABP_Item_C* Item, class AActor* WildClassActor);
	void OnBlendOut_A3C9360742B9DF1A3DF06EAC05B27EC4(class FName NotifyName);
	void OnCompleted_A3C9360742B9DF1A3DF06EAC05B27EC4(class FName NotifyName);
	void OnInterrupted_A3C9360742B9DF1A3DF06EAC05B27EC4(class FName NotifyName);
	void OnNotifyBegin_A3C9360742B9DF1A3DF06EAC05B27EC4(class FName NotifyName);
	void OnNotifyEnd_A3C9360742B9DF1A3DF06EAC05B27EC4(class FName NotifyName);
	void ReceiveBeginPlay();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GambaMachine_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GambaMachine_C")
	}
	static class ABP_GambaMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GambaMachine_C>();
	}
};
// DUMPER7_ASSERTS_ABP_GambaMachine_C;

SDK_NAMESPACE_END
