#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Item_Nitro

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_Item_Nitro.BP_Item_Nitro_C.ExecuteUbergraph_BP_Item_Nitro
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Item_Nitro_C_ExecuteUbergraph_BP_Item_Nitro final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_BP_Item_Nitro_C_ExecuteUbergraph_BP_Item_Nitro;

// Function BP_Item_Nitro.BP_Item_Nitro_C.OnBlendOut_C18483AF4363EB776EB07C9EA0D91A18
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Nitro_C_OnBlendOut_C18483AF4363EB776EB07C9EA0D91A18 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_BP_Item_Nitro_C_OnBlendOut_C18483AF4363EB776EB07C9EA0D91A18;

// Function BP_Item_Nitro.BP_Item_Nitro_C.OnCompleted_C18483AF4363EB776EB07C9EA0D91A18
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Nitro_C_OnCompleted_C18483AF4363EB776EB07C9EA0D91A18 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_BP_Item_Nitro_C_OnCompleted_C18483AF4363EB776EB07C9EA0D91A18;

// Function BP_Item_Nitro.BP_Item_Nitro_C.OnInterrupted_C18483AF4363EB776EB07C9EA0D91A18
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Nitro_C_OnInterrupted_C18483AF4363EB776EB07C9EA0D91A18 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_BP_Item_Nitro_C_OnInterrupted_C18483AF4363EB776EB07C9EA0D91A18;

// Function BP_Item_Nitro.BP_Item_Nitro_C.OnNotifyBegin_C18483AF4363EB776EB07C9EA0D91A18
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Nitro_C_OnNotifyBegin_C18483AF4363EB776EB07C9EA0D91A18 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_BP_Item_Nitro_C_OnNotifyBegin_C18483AF4363EB776EB07C9EA0D91A18;

// Function BP_Item_Nitro.BP_Item_Nitro_C.OnNotifyEnd_C18483AF4363EB776EB07C9EA0D91A18
// 0x0008 (0x0008 - 0x0000)
struct BP_Item_Nitro_C_OnNotifyEnd_C18483AF4363EB776EB07C9EA0D91A18 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_BP_Item_Nitro_C_OnNotifyEnd_C18483AF4363EB776EB07C9EA0D91A18;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
