#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lobby

#include "Basic.hpp"

#include "SteamCoreShared_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_Lobby.BP_Lobby_C.ExecuteUbergraph_BP_Lobby
// 0x0090 (0x0090 - 0x0000)
struct BP_Lobby_C_ExecuteUbergraph_BP_Lobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamSessionSetting                   CallFunc_MakeString_ReturnValue;                   // 0x0008(0x0028)()
	TMap<class FString, struct FSteamSessionSetting> K2Node_MakeMap_Map;                             // 0x0030(0x0050)()
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CanyonGameInstance_C*               CallFunc_F_GetGameInstance_AsBG_Game_Instance;     // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_BP_Lobby_C_ExecuteUbergraph_BP_Lobby;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
