#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LobbyFireworkSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_LobbyFireworkSpawner.BP_LobbyFireworkSpawner_C
// 0x0048 (0x02F8 - 0x02B0)
class ABP_LobbyFireworkSpawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Locations;                                         // 0x02C8(0x0010)(Edit, BlueprintVisible)
	TArray<class UNiagaraSystem*>                 Systems;                                           // 0x02D8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FLinearColor>                   Colors;                                            // 0x02E8(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_LobbyFireworkSpawner(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LobbyFireworkSpawner_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LobbyFireworkSpawner_C")
	}
	static class ABP_LobbyFireworkSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LobbyFireworkSpawner_C>();
	}
};
// DUMPER7_ASSERTS_ABP_LobbyFireworkSpawner_C;

SDK_NAMESPACE_END
