#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_BestiaryMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass UI_BestiaryMenu.UI_BestiaryMenu_C
// 0x0028 (0x0350 - 0x0328)
class UUI_BestiaryMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUI_Equipment_GoBack_C*                 UI_Equipment_GoBack;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Zurker;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Cryptic;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_BestiaryMenu_Button_Cryptic_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__UI_BestiaryMenu_Button_Cryptic_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_BestiaryMenu_Button_Zurker_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__UI_Customization_UI_Equipment_GoBack_K2Node_ComponentBoundEvent_2_disp_Click__DelegateSignature(bool forced);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_UI_BestiaryMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_BestiaryMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_BestiaryMenu_C")
	}
	static class UUI_BestiaryMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_BestiaryMenu_C>();
	}
};
// DUMPER7_ASSERTS_UUI_BestiaryMenu_C;

SDK_NAMESPACE_END
