#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Bestiary

#include "Basic.hpp"

#include "E_Army_structs.hpp"
#include "UI_Equipment_Progress_classes.hpp"
#include "Engine_structs.hpp"
#include "S_PlayerSkins_structs.hpp"
#include "S_Bestiary_structs.hpp"
#include "E_Rarity_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass UI_Bestiary.UI_Bestiary_C
// 0x0270 (0x05E8 - 0x0378)
class UUI_Bestiary_C final : public UUI_Equipment_Progress_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_Bestiary_C;                      // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Text_SkinName;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_NotOwnedText;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_KillCount;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Description;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_SkinButtons;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Skin;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             GridPanel_Holder;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChangeSkin;                                        // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         availableSkins;                                    // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 previewedSkin;                                     // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_EnemyProxy_C*                       enemyProxy;                                        // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_CanyonGameInstance_C*               gameInstanceRef;                                   // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   selectedCurrentEnemy;                              // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           runtimeAllEnemies;                                 // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FS_PlayerSkins                         selectedSkinDatas;                                 // 0x0408(0x0160)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UUI_Template_LargeButton_C*>     spawnedListItems;                                  // 0x0568(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	E_Army                                        army;                                              // 0x0578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Bestiary                            selecteEnemyData;                                  // 0x0580(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         builtId;                                           // 0x05D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         wipRow;                                            // 0x05D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         wipColumn;                                         // 0x05D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        spawnedSound;                                      // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_UI_Bestiary(int32 EntryPoint);
	void F_BuildList();
	void F_BuildListCategory(E_Rarity Rarity, const class FText& CustomName);
	void F_GoBack(bool forced);
	void F_SelectEnemy(int32 ID, class FName Wildcard);
	void F_Update(class FName enemyName);
	void F_UpdateEnemyProxy();
	void F_UpdateUnlocked(bool* Unlocked);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Bestiary_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Bestiary_C")
	}
	static class UUI_Bestiary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Bestiary_C>();
	}
};
// DUMPER7_ASSERTS_UUI_Bestiary_C;

SDK_NAMESPACE_END
