#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_FeedbackBoard

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UI_FeedbackBoard.UI_FeedbackBoard_C.ExecuteUbergraph_UI_FeedbackBoard
// 0x0030 (0x0030 - 0x0000)
struct UI_FeedbackBoard_C_ExecuteUbergraph_UI_FeedbackBoard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_TransitionAnim_C*                   CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_Manager_Menu_C*                     CallFunc_F_GetMenus_bp_Menu;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_forced;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Manager_Menu_C*                     CallFunc_F_GetMenus_bp_Menu_1;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_TransitionAnim_C*                   CallFunc_Create_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_UI_FeedbackBoard_C_ExecuteUbergraph_UI_FeedbackBoard;

// Function UI_FeedbackBoard.UI_FeedbackBoard_C.BndEvt__UI_FeedbackBoard_UI_Equipment_GoBack_K2Node_ComponentBoundEvent_0_disp_Click__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_FeedbackBoard_C_BndEvt__UI_FeedbackBoard_UI_Equipment_GoBack_K2Node_ComponentBoundEvent_0_disp_Click__DelegateSignature final
{
public:
	bool                                          forced;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_UI_FeedbackBoard_C_BndEvt__UI_FeedbackBoard_UI_Equipment_GoBack_K2Node_ComponentBoundEvent_0_disp_Click__DelegateSignature;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
